#todo: Написать программу, которая считывает два числа и выводит их сумму, разность, частное, произведение,
# результат целочисленного деления, результат деления с остатком, результат возведения в степень.

x = int(input())
y = int(input())

# Сумма:
print(x + y)

# Разность
print(x - y)

# Частное
print(x / y)

# Произведение
print(x * y)

# Результат целочисленного деления
print(x // y)

# Результат деления с остатком
print(x % y)

# Результат возведения в степень
print(x**y)